Repository: th-otto/MagicOnLinux
Catalog: po/*.po
Languages: de, fr

source: Host Paths
de: Host Pfade
fr: Chemins d'hôte

source: Configure kernel, rootfs, and temporary paths on the host system
de: Konfiguriert Kernel-, Rootfs- und temporäre Pfade auf dem Host-System
fr: Configure les chemins du noyau, du rootfs et temporaires sur le système hôte

source: Kernel File (ROM)
de: Kernel-Datei (ROM)
fr: Fichier Kernel (ROM)

source: Path to the Atari Kernel/ROM file. If empty, MAGICLIN.OS in the root filesystem will be used.
de: Pfad zur Atari Kernel/ROM-Datei Falls leer, wird MAGICLIN.OS im Stammverzeichnis verwendet.
fr: Chemin d'accès au fichier noyau/ROM Atari. Si ce champ est vide, le fichier MAGICLIN.OS situé à la racine du système de fichiers sera utilisé.

source: Path for boot filesystem (Folder)
de: Boot-Dateisystem (Ordner)
fr: Système de fichiers racine (Dossier)

source: Path to the host directory containing the root filesystem of the emulation
de: Pfad zum Host-Verzeichnis, das das Root-Dateisystem der Emulation enthält
fr: Chemin d'accès au répertoire hôte contenant le système de fichiers racine de l'émulation

source: Mount $HOME directory as drive H:
de: $HOME-Verzeichnis als Laufwerk H: einbinden
fr: Monter le répertoire $HOME comme lecteur H:

source: If enabled, mounts the host home directory (~/) as U:/home inside the emulation
de: Wenn aktiviert, wird das Host-Home-Verzeichnis (~/) als U:/home innerhalb der Emulation gemountet.
fr: Si activé, monte le répertoire d'accueil hôte (~/) comme U:/home à l'intérieur de l'émulation

source: Set HOME directory read-only
de: Home-Ordner schreibgeschützt
fr: Dossier d'accueil hôte en lecture seule

source: Mounts the host home directory as read-only. Requires 'Mount $HOME...' to be enabled
de: Mountet das Host-Home-Verzeichnis schreibgeschützt. Erfordert, dass 'Mount $HOME...' aktiviert ist
fr: Monte le répertoire d'accueil hôte en lecture seule. Nécessite que 'Mount $HOME...

source: Mount host root directory (/)
de: Host-Root-Pfad (/) mounten
fr: Monter le chemin racine de l'hôte (/)

source: If enabled, mounts the host root directory (/) for full system access
de: Wenn aktiviert, wird das Host-Root-Verzeichnis (/) für vollen Systemzugriff gemountet
fr: Si activé, monte le répertoire racine hôte (/) pour un accès complet au système

source: Set root directory read-only
de: Host-Root-Pfad schreibgeschützt
fr: Chemin racine hôte en lecture seule

source: Mounts the host root directory as read-only. Requires 'Mount Host Root Path' to be enabled
de: Mountet das Host-Root-Verzeichnis schreibgeschützt. Erfordert, dass 'Mount Host Root Path' aktiviert ist
fr: Monte le répertoire racine hôte en lecture seule. Nécessite que 'Mount Host Root Path' soit activé

source: Path for temp files
de: Temporärer Host-Pfad
fr: Chemin d'hôte temporäre

source: Host directory used by the emulation for temporary files
de: Host-Verzeichnis, das von der Emulation für temporäre Dateien verwendet wird
fr: Répertoire hôte utilisé par l'émulation pour les fichiers temporären

source: Host Devices
de: Host Geräte
fr: Périphériques d'hôte

source: Set the host device paths for serial communication and printing
de: Legt die Host-Gerätepfade für serielle Kommunikation und Drucken fest
fr: Définit les chemins des périphériques hôtes pour la communication série et l'impression

source: Print command (program/file)
de: Druckbefehl (Programm/Datei)
fr: Commande d'impression (Programmes/Fichier)

source: Command or device path used to handle printing output from the emulation
de: Befehl oder Gerätepfad zur Verarbeitung der Druckausgabe aus der Emulation
fr: Commande ou chemin de périphérique utilisé pour gérer la sortie d'impression de l'émulation

source: Serial device (e.g., /dev/ttyS0)
de: Serielle Gerätedatei (z.B. /dev/ttyS0)
fr: Fichier périphérique série (p. ex. /dev/ttyS0)

source: Path to the host serial device (e.g., /dev/ttyS0) for serial communication
de: Pfad zur seriellen Host-Gerätedatei (z.B. /dev/ttyS0) für die serielle Kommunikation
fr: Chemin d'accès au périphérique série hôte (p. ex. /dev/ttyS0) pour la serielle Kommunikation

source: Atari Screen
de: Atari Bildschirm
fr: Écran Atari

source: Adjust the Atari screen resolution, refresh rate, scaling, and mouse hiding
de: Passt die Atari-Bildschirmauflösung, Aktualisierungsrate, Skalierung und die Maus-Ausblendung an
fr: Ajuste la résolution de l'écran Atari, le taux de rafraîchissement, la mise à l'échelle et le masquage de la souris

source: Resolution (Width in Pixels)
de: Auflösung (Breite in Pixel)
fr: Résolution (Largeur en pixels)

source: The display resolution in pixels for the Atari screen window
de: Die Anzeigeauflösung in Pixeln für das Atari-Bildschirmfenster
fr: La résolution d'affichage en pixels pour la fenêtre d'écran Atari

source: Resolution (Height in Pixels)
de: Auflösung (Höhe in Pixel)
fr: Résolution (Hauteur en pixels)

source: X Stretch Factor (Scaling)
de: X-Stretch-Faktor (Skalierung)
fr: Facteur d'étirement X (Mise à l'échelle)

source: Horizontal scaling factor (1 = normal, 2 = double width, etc.)
de: Horizontaler Skalierungsfaktor (1 = normal, 2 = doppelte Breite, etc.)
fr: Facteur d'étirement X (Mise à l'échelle)

source: Y Stretch Factor (Scaling)
de: Y-Stretch-Faktor (Skalierung)
fr: Facteur d'étirement Y (Mise à l'échelle)

source: Vertical scaling factor (1 = normal, 2 = double height, etc
de: Vertikaler Skalierungsfaktor (1 = normal, 2 = doppelte Höhe, etc.)
fr: Facteur d'étirement Y (Mise à l'échelle)

source: Refresh Rate (Hz)
de: Bildwiederholrate (Hz)
fr: Taux de rafraîchissement (Hz)

source: Target screen refresh rate in Hertz (Hz)
de: Zielbildwiederholrate in Hertz (Hz)
fr: Taux de rafraîchissement cible en Hertz (Hz)

source: Screen color mode
de: Farbtiefe/Modus
fr: Profondeur/Mode couleur

source: Select the color depth or graphics mode used for the screen
de: Wählen Sie die Farbtiefe oder den Grafikmodus für den Bildschirm
fr: Sélectionnez la profondeur de couleur ou le mode graphique utilisé pour l'écran

source: 24-bit true color
fr: 24 bits TrueColor

source: 16-bit high color
fr: 16 bits HighColor

source: 256 colors, packed pixels
de: 256 Farben, gepackte Pixel
fr: 256 Couleurs, pixels compactés

source: 16 colors, packed pixels
de: 16 Farben, gepackte Pixel
fr: 16 Couleurs, pixels compactés

source: 16 colors, interleaved planes
de: 16 Farben, verschachtelte Ebenen
fr: 16 couleurs, plans entrelacés

source: 4 colors, interleaved planes
de: 4 Farben, verschachtelte Ebenen
fr: 4 couleurs, plans entrelacés

source: Hide host mouse
de: Host-Mauszeiger ausblenden
fr: Masquer le pointeur de la souris hôte

source: Hides the host operating system's mouse pointer when it is over the emulation window
de: Blendet den Mauszeiger des Host-Betriebssystems aus, wenn er sich über dem Emulationsfenster befindet
fr: Masquer le pointeur de la souris du système d'exploitation hôte lorsqu'il est au-dessus de la fenêtre d'émulation

source: Use relative mousemode
de: Relativen Mausmodus verwenden
fr: Utiliser le mode souris relatif

source: Tells SDL to send relative mouse movements
de: Weist SDL an, relative Mausbewegungen zu senden
fr: Indique à SDL d'envoyer les mouvements relatifs de la souris.

source: Window Placement
de: Fensterposition
fr: Placement de la fenêtre

source: Define the window's position (X/Y) and which display it should appear on
de: Definiert die Position (X/Y) und auf welchem Display das Fenster erscheinen soll
fr: Définit la position (X/Y) et l'affichage sur lequel la fenêtre doit apparaître

source: Monitor
fr: Moniteur

source: The display number (e.g., 0, 1, 2) on which the window should appear
de: Die Display-Nummer (z.B. 0, 1, 2) auf der das Fenster erscheinen soll
fr: Le numéro d'affichage (p. ex. 0, 1, 2) sur lequel la fenêtre doit apparaître

source: Window position X (left)
de: Fensterposition X (links)
fr: Position de la fenêtre X (gauche)

source: Window position coordinates relative to the top-left corner of the screen
de: Fensterpositionskoordinaten relativ zur oberen linken Ecke des Bildschirms.
fr: Coordonnées de position de la fenêtre par rapport au coin supérieur gauche de l'écran

source: Window position Y (top)
de: Fensterposition Y (oben)
fr: Position de la fenêtre Y (haut)

source: Atari Emulation
fr: Émulation Atari

source: General emulation settings, including RAM size, language ROM, and menu behavior
de: Allgemeine Emulationseinstellungen, einschließlich RAM-Größe, Sprach-ROM und Menüverhalten
fr: Paramètres d'émulation généraux, y compris la taille de la RAM, la ROM de langue et le comportement du menu

source: Memory size (RAM in bytes)
de: Speichergröße (RAM in Bytes)
fr: Taille de la mémoire (RAM en octets)

source: Amount of RAM allocated to the emulated system (e.g., 8MB, 32MB)
de: Die dem emulierten System zugewiesene RAM-Menge (z.B. 8MB, 32MB)
fr: Quantité de RAM allouée au système émulé (p. ex. 8MB, 32MB)

source: Atari language
de: Atari-Sprache
fr: Langue Atari

source: Selects the language ROM to be used by the emulation (affects keyboard layout and startup language)
de: Wählt die Sprach-ROM aus, die von der Emulation verwendet werden soll (betrifft Tastaturlayout und Startsprache)
fr: Sélectionne la ROM de langue à utiliser par l'émulation (affecte la disposition du clavier et la langue de démarrage)

source: English (USA)
de: Englisch (USA)
fr: Anglais (USA)

source: German
de: Deutsch
fr: Allemand

source: French
de: Französisch
fr: Français

source: Application language
de: Anwendungssprache
fr: Langue de l'application

source: Selects the language for this application
de: Wählt die Sprache für diese Anwendung aus
fr: Sélectionne la langue de cette application

source: System Default
de: Systemsprache
fr: Langue du système

source: English (UK)
de: Englisch (UK)
fr: Anglais (UK)

source: Show host menu
de: Host-Menü anzeigen
fr: Afficher le menu hôte

source: If enabled, the host menu bar (File, View, Help, etc.) is visible
de: Wenn aktiviert, ist die Host-Menüleiste (Datei, Ansicht, Hilfe usw.) sichtbar
fr: Si activée, la barre de menu hôte (Fichier, Affichage, Aide, etc.) est visible

source: Auto start MagiC
de: Emulation automatisch starten
fr: Démarrage automatique de l'émulation

source: If enabled, the emulation starts immediately upon application launch
de: Wenn aktiviert, startet die Emulation sofort nach dem Start der Anwendung
fr: Si activée, l'émulation démarre immédiatement au lancement de l'application

source: Show Help Tooltips
de: Hilfe-Tooltips anzeigen
fr: Afficher les infobulles d'aide

source: Toggle help tooltips for all widgets
de: Hilfe-Tooltips für alle Widgets ein-/ausschalten
fr: Activer/désactiver les infobulles d'aide pour tous les widgets

source: Additional Drives
de: Zusätzliche Laufwerke
fr: Lecteurs additionnels

source: Manage additional mounted host folders or disk image files (A-Z) for the emulation
de: Verwaltet zusätzliche gemountete Host-Ordner oder Disketten-Image-Dateien (A-Z) für die Emulation
fr: Gère les dossiers hôtes montés supplémentaires ou les fichiers d'image disque (A-Z) pour l'émulation

source: Path for Drive A:
de: Pfad für Laufwerk A:
fr: Chemin pour le lecteur A:

source: Path for Drive B:
de: Pfad für Laufwerk B:
fr: Chemin pour le lecteur B:

source: Path for Drive D:
de: Pfad für Laufwerk D:
fr: Chemin pour le lecteur D:

source: Path for Drive E:
de: Pfad für Laufwerk E:
fr: Chemin pour le lecteur E:

source: Path for Drive F:
de: Pfad für Laufwerk F:
fr: Chemin pour le lecteur F:

source: Path for Drive G:
de: Pfad für Laufwerk G:
fr: Chemin pour le lecteur G:

source: Path for Drive I:
de: Pfad für Laufwerk I:
fr: Chemin pour le lecteur I:

source: Path for Drive J:
de: Pfad für Laufwerk J:
fr: Chemin pour le lecteur J:

source: Path for Drive K:
de: Pfad für Laufwerk K:
fr: Chemin pour le lecteur K:

source: Path for Drive L:
de: Pfad für Laufwerk L:
fr: Chemin pour le lecteur L:

source: Path for Drive N:
de: Pfad für Laufwerk N:
fr: Chemin pour le lecteur N:

source: Path for Drive O:
de: Pfad für Laufwerk O:
fr: Chemin pour le lecteur O:

source: Path for Drive P:
de: Pfad für Laufwerk P:
fr: Chemin pour le lecteur P:

source: Path for Drive Q:
de: Pfad für Laufwerk Q:
fr: Chemin pour le lecteur Q:

source: Path for Drive R:
de: Pfad für Laufwerk R:
fr: Chemin pour le lecteur R:

source: Path for Drive S:
de: Pfad für Laufwerk S:
fr: Chemin pour le lecteur S:

source: Path for Drive T:
de: Pfad für Laufwerk T:
fr: Chemin pour le lecteur T:

source: Path for Drive V:
de: Pfad für Laufwerk V:
fr: Chemin pour le lecteur V:

source: Path for Drive W:
de: Pfad für Laufwerk W:
fr: Chemin pour le lecteur W:

source: Path for Drive X:
de: Pfad für Laufwerk X:
fr: Chemin pour le lecteur X:

source: Path for Drive Y:
de: Pfad für Laufwerk Y:
fr: Chemin pour le lecteur Y:

source: Path for Drive Z:
de: Pfad für Laufwerk Z:
fr: Chemin pour le lecteur Z:

source: Network
de: Netzwerk
fr: Réseau

source: Configure network settings for the emulated Ethernet device (ETH0)
de: Konfiguriert die Netzwerkeinstellungen für das emulierte Ethernet-Gerät (ETH0)
fr: Configure les paramètres réseau pour le périphérique Ethernet émulé (ETH0)

source: Network Type
de: Netzwerk-Typ
fr: Type de réseau

source: Select the Ethernet emulation mode (e.g., Disabled, TAP/Tunnel)
de: Wählen Sie den Ethernet-Emulationsmodus (z.B. Deaktiviert, TAP/Tunnel)
fr: Sélectionnez le mode d'émulation Ethernet (p. ex. Désactivé, TAP/Tunnel)

source: Disabled
de: Deaktiviert
fr: Désactivé

source: Bridge
de: Brücke
fr: Pont

source: Point-to-Point
de: Punkt-zu-Punkt
fr: Point-à-point

source: Tunnel Device
de: Tunnel-Gerät
fr: Périphérique tunnel

source: The host's virtual network interface name (e.g., tap0)
de: Der Name der virtuellen Netzwerkschnittstelle des Hosts (z.B. tap0)
fr: Nom de l'interface réseau virtuelle de l'hôte (p. ex. tap0)

source: Host IP
de: Host IP-Adresse
fr: Adresse IP hôte

source: The IP address of the Host's side of the virtual link
de: Die IP-Adresse der Host-Seite der virtuellen Verbindung
fr: Adresse IP du côté hôte du lien virtuel

source: Atari IP
de: Atari IP-Adresse
fr: Adresse IP Atari

source: The IP address assigned to the emulated Atari device
de: Die dem emulierten Atari-Gerät zugewiesene IP-Adresse
fr: Adresse IP attribuée au périphérique Atari émulé

source: Netmask
de: Netzmaske
fr: Masque de sous-réseau

source: The network mask for the virtual subnet
de: Die Netzwerkmaske für das virtuelle Subnetz
fr: Masque de sous-réseau pour le sous-réseau virtuel

source: Gateway
fr: Passerelle

source: The gateway IP address (usually the host IP)
de: Die Gateway-IP-Adresse (normalerweise die Host-IP)
fr: Adresse IP de la passerelle (généralement l'IP hôte)

source: MAC address
de: MAC-Adresse
fr: Adresse MAC

source: The unique MAC address for the emulated device
de: Die eindeutige MAC-Adresse für das emulierte Gerät
fr: Adresse MAC unique pour le périphérique émulé

source: Interrupt Level
fr: Niveau d'interruption

source: The interrupt level used by the emulated device (4 is standard)
de: Der vom emulierten Gerät verwendete Interrupt-Level (4 ist Standard)
fr: Niveau d'interruption utilisé par le périphérique émulé (4 est standard)

source: _OK
fr: _Valider

source: _Cancel
de: _Abbruch
fr: _Annuler

source: %s - a GTK-based xmessage clone
de: %s - Ein GTK-basierter Xmessage-Klon
fr: %s - un clone xmessage basé sur GTK

source: Usage: %s [OPTIONS] message ...
de: Syntax: %s [OPTIONEN] Nachricht ...
fr: Utilisation: %s [OPTIONS] message ...

source: %s [OPTIONS] -file FILENAME
de: %s [OPTIONEN] -file Dateiname
fr: %s [OPTIONS] -file NOM_FICHIER

source: xmessage options:
de: Xmessage Optionen:
fr: Options xmessage:

source: -file FILENAME Get message text from file, '-' for stdin
de: -file Dateiname Text aus Datei beziehen, '-' für stdin
fr: -file NOM_DU_FICHIER Récupérer le texte du message depuis un fichier, '-' pour l'entrée standard

source: -buttons BUTTON_LIST List of "LABEL:EXIT_CODE", comma separated
de: -buttons Button-Liste Listenform "LABEL:EXIT_CODE", Komma-separiert
fr: -buttons BUTTON_LIST Liste de "LABEL:EXIT_CODE", séparés par des virgules

source: -default LABEL Give keyboard focus to the specified button
de: -default LABEL Tastatur-Fokus auf angegebenen Button setzen
fr: -default LABEL Donner le focus clavier au bouton spécifié

source: -print Send the selected button's LABEL to stdout
de: -print LABEL des gewählten Buttons an stdout senden
fr: -print Afficher l'étiquette du bouton sélectionné sur la sortie standard

source: -center Open the window in the center of the screen
de: -center Fenster auf dem Bildschirm zentrieren
fr: -center Ouvrir la fenêtre au centre de l'écran

source: -nearmouse Open the window near the mouse pointer
de: -nearmouse Fenster am Mauszeiger öffnen
fr: -nearmouse Ouvrir la fenêtre près du pointeur de la souris

source: -timeout SECONDS Exit with code 0 after SECONDS seconds
de: -timeout SEKUNDEN Mit Fehler-Kode 0 nach SEKUNDEN beenden
fr: -timeout SECONDES Sortie avec le code 0 après SECONDES secondes

source: -display DISPLAY X display to use
de: -display ANZEIGE Zu benutzende X-Anzeige
fr: -display AFFICHAGE Affichage X à utiliser

source: -fn FONT | -font FONT Set message font (works with GTK font names)
de: -fn | -font SCHRIFT Schriftart der Nachricht (benutzt GTK-Schriftart-Namen)
fr: -fn | -font POLICE Définir la police des messages (fonctionne avec les noms de polices GTK)

source: -fg COLOR Set message font color
de: -fg FARBE Textfarbe der Anzeige
fr: -fg COULEUR Définir la couleur de la police du message

source: -bg COLOR Set message background color
de: -bg FARBE Hintergrundfarbe der Anzeige
fr: -bg COULEUR Définir la couleur d'arrière-plan du message

source: -geometry GEOMETRY Set window size (position will be ignored)
de: -geometry GEOMETRIE Fenstergröße (Position wird ignoriert)
fr: -geometry GÉOMÉTRIE Définir la taille de la fenêtre (la position sera ignorée)

source: -iconic Start iconified
de: -iconic Minimierter Start
fr: -icône de démarrage iconique

source: -name NAME Program name as used by the window manager
de: -name NAME Programm-Name wie vom Fenstermanager benutzt
fr: -name NOM Nom du programme tel qu'utilisé par le gestionnaire de fenêtres

source: -title TITLE Set window title to TITLE
de: -title TITEL TITEL als Fenster-Titel wählen
fr: -title TITRE Définir le titre de la fenêtre sur TITRE

source: Additional %s options:
de: Zusätzliche %s Optionen:
fr: Options supplémentaires %s:

source: -borderless Open the window without border decoration
de: -borderless Fenster ohne Rahmen-Dekoration anzeigen
fr: -borderless Ouvrir la fenêtre sans bordure décorative

source: -sticky Make the window stick to all desktops
de: -sticky Das Fenster an allen Desktops fixieren
fr: -sticky Permet de fixer la fenêtre sur tous les bureaux

source: -ontop Keep window on top
de: -ontop Fenster oben halten
fr: -ontop Garder la fenêtre en haut

source: -nofocus Don't focus the window when it opens
de: -nofocus Fokus nicht auf geöffnetes Fenster setzen
fr: -nofocus Ne pas donner le focus à la fenêtre lors de son ouverture

source: -noescape Don't allow pressing ESC to close the window
de: -noescape Das Drücken der ESC-Taste soll das Fenster nicht schließen.
fr: -noescape Empêcher la fermeture de la fenêtre avec la touche ÉCHAP

source: -encoding CHARSET Expect CHARSET as the message encoding
de: -encoding ZEICHENSATZ ZEICHENSATZ für die Anzeige verwenden
fr: -encoding CHARSET L'encodage du message doit être de type CHARSET.

source: -entry Prompt for text to be sent to stdout
de: -entry Eingabe für stdout anfordern
fr: -entry Invite de saisie de texte à envoyer à la sortie standard

source: -entrytext TEXT Same as -entry, but with TEXT as default text
de: -entrytext TEXT Gleicht -entry, aber mit Vorgabe von TEXT
fr: -entrytext TEXT Identique à -entry, mais avec TEXT comme texte par défaut

source: -wrap Wrap lines of text to fit window width
de: -wrap Textzeilen an Fensterbreite anpassen
fr: -wrap Retour à la ligne automatique pour s'adapter à la largeur de la fenêtre

source: -help | -? Show this usage information
de: -help | -? Diese Hilfe anzeigen
fr: -help | -? Afficher ces informations d'utilisation

source: -version Show gxmessage version and Copyright details
de: -version gxmessage-Version und Copyright-Details anzeigen
fr: -version Afficher la version de gxmessage et les informations relatives aux droits d'auteur

source: Please report bugs to %s.
de: Fehler bitte an %s melden.
fr: Veuillez signaler les bogues à %s.

source: %s: can't have both -entry and -print
de: %s: Kann -entry und -print nicht gleichzeitig verwenden
fr: %s: impossible d'avoir à la fois -entry et -print

source: %s: can't get message from both -file and command line
de: %s: Kann nicht Text von -file und Befehlszeile gleichzeitig verwenden
fr: %s: impossible de récupérer le message à la fois depuis le fichier et la ligne de commande

source: %s: integer -timeout value expected
de: %s: -timeout Wert als Integer-Ausdruck erwartet
fr: %s: valeur de délai d'attente entière attendue

source: %s: unable to read file
de: %s: Kann Datei nicht lesen
fr: %s: impossible de lire le fichier

source: %s: message text is required
de: %s: Anzeigetext erforderlich
fr: %s: le texte du message est obligatoire

source: Try `%s --help' for more information
de: Versuchen Sie `%s --help' für mehr Informationen
fr: Essayez `%s --help` pour plus d'informations

source: Accept and confirm the changes in this dialog
de: Akzeptiert und bestätigt die Änderungen in diesem Dialog
fr: Accepte et confirme les modifications dans cette boîte de dialogue

source: Discard the current changes and close the dialog
de: Verwirft die aktuellen Änderungen und schließt den Dialog
fr: Ignore les modifications actuelles und ferme la boîte de dialogue

source: Select a Folder
de: Ordner auswählen
fr: Sélectionnez un dossier

source: Select a File
de: Datei auswählen
fr: Sélectionnez un fichier

source: read-only
de: Nur lesbar
fr: lecture seule

source: Mount drive in read-only mode, preventing writes from the emulation
de: Laufwerk schreibgeschützt mounten, verhindert Schreibzugriffe von der Emulation
fr: Monter le lecteur en lecture seule, empêchant l'écriture par l'émulation

source: DOS 8+3 format
de: 8.3 Dateinamen
fr: 8.3 Noms de fichiers

source: Force 8.3 short filenames (FAT-style) on host directories
de: Erzwingt 8.3 Kurzdateinamen (FAT-Stil) für Host-Verzeichnisse
fr: Forcer les noms de fichiers courts 8.3 (style FAT) sur les répertoires hôtes

source: case insensitive
de: Groß-/Kleinschreibung nicht beachten
fr: insensible à la casse

source: Ignore case sensitivity when accessing files/folders
de: Ignoriert Groß-/Kleinschreibung beim Zugriff auf Dateien/Ordner
fr: Ignorer la sensibilité à la casse lors de l'accès aux fichiers/dossiers

source: %s:%d: unknown section '%s'
de: %s:%d: Unbekannter Abschnitt '%s'
fr: %s:%d: section inconnue '%s'

source: %s:%d: Syntax error: %s
de: %s:%d: Syntaxfehler: %s
fr: %s:%d: Erreur de syntaxe: %s

source: _Save
de: _Sichern
fr: _Sauvegarder

source: _Delete
de: _Verwerfen
fr: _Supprimer

source: You have unsaved changes. Do you want to save them and quit?
de: Sie haben ungespeicherte Änderungen. Wollen Sie diese speichern und das Programm beenden?
fr: Vous avez des modifications non enregistrées. Voulez-vous les enregistrer et quitter ?

source: You have unsaved changes. Do you want to discard them and quit?
de: Sie haben ungespeicherte Änderungen. Wollen Sie diese verwerfen und das Programm beenden?
fr: Vous avez des modifications non sauvegardées. Voulez-vous les ignorer et quitter?

source: Spanish
de: Spanisch
fr: Espagnole

source: Italian
de: Italienisch
fr: Italien

source: Swedish
de: Schwedisch
fr: Suédois

source: French (Switzerland)
de: Französisch (Schweitz)
fr: Français (Suisse)

source: German (Switzerland)
de: Deutsch (Schweitz)
fr: Allemand (Suisse)
