Repository: th-otto/MagicOnLinux
Catalog: po/*.po
Languages: de, fr

source: Turkish
de: Türkisch
fr: Turc

source: Finnish
de: Finnisch
fr: Finlandais

source: Norwegian
de: Norwegisch
fr: Norvégien

source: Danish
de: Dänisch
fr: Danois

source: Arabic
de: Arabisch
fr: Arabe

source: Dutch
de: Niederländisch
fr: Néerlandais

source: Hungarian
de: Ungarisch
fr: Hongrois

source: Czech
de: Tschechisch
fr: Tchèque

source: Polish
de: Polnisch
fr: Polonais

source: Lithuanian
de: Litauisch
fr: Lituanien

source: Russian
de: Russisch
fr: Russe

source: Estonian
de: Estnisch
fr: Estonien

source: Belarusian
de: Weißrussisch
fr: Biélorusse

source: Ukrainian
de: Ukrainisch
fr: Ukrainien

source: Slovak
de: Slowakisch
fr: Slovaque

source: Romanian
de: Rumänisch
fr: Roumain

source: Bulgarian
de: Bulgarisch
fr: Bulgare

source: Slovenian
de: Slowenisch
fr: Slovène

source: Croatian
de: Kroatisch
fr: Croate

source: Serbian
de: Serbisch
fr: Serbe

source: Serbian (Montenegro)
de: Serbisch (Montenegro)
fr: Serbe (Monténégro)

source: Macedonian
de: Mazedonisch
fr: Macédonien

source: Greek
de: Griechisch
fr: Grec

source: Latvian
de: Lettisch
fr: Letton

source: Hebrew
de: Hebräisch
fr: Hébreu

source: Afrikaans
fr: Afrikaner

source: Portuguese
de: Portugiesisch
fr: Portugais

source: Walloon
de: Wallonisch
fr: Wallon

source: Japanese
de: Japanisch
fr: Japonais

source: Chinese
de: Chinesisch
fr: Chinois

source: Korean
de: Koreanisch
fr: Coréen

source: Vietnamese
de: Vietnamesisch
fr: Vietnamien

source: Persian
de: Persisch
fr: Persan

source: Mongolian
de: Mongolisch
fr: Mongol

source: Nepali
fr: Népalais

source: Lao
de: Laotisch
fr: Laos

source: Indonesian
de: Indonesisch
fr: Indonésien

source: MagicOnLinux Settings
de: MagicOnLinux Einstellungen
fr: Paramètres MagicOnLinux

source: Sets the client geometry of the main window
de: Legt die Clientgeometrie des Hauptfensters fest
fr: Définit la géométrie client de la fenêtre principale

source: GEOMETRY
de: GEOMETRIE
fr: GÉOMÉTRIE

source: Specify an alternative configuration file path
de: Geben Sie einen alternativen Konfigurationsdateipfad an
fr: Spécifiez un autre chemin d'accès au fichier de configuration

source: FILE
de: DATEI
fr: FICHER

source: Show version information and exit
de: Versionsinformationen anzeigen und beenden
fr: Afficher des informations de version et quitter

source: Show help information and exit
de: Hilfeinformationen anzeigen und beenden
fr: Afficher les informations d'aide et quitter

source: GTK Configurator for MagicOnLinux
de: GTK-Konfigurator für MagicOnLinux
fr: Configurateur GTK pour MagicOnLinux

source: error parsing command line
de: Fehler beim Parsen der Befehlszeile
fr: erreur d'analyse de la ligne de commande

source: value %ld out of range %ld..%ld
de: Wert %ld außerhalb des Bereichs %ld..%ld
fr: valeur %ld hors plage %ld..%ld

source: unknown key
de: unbekanntes Schlüsselwort
fr: clé inconnue

source: Syntax error in configuration file:%d: %s
de: Syntaxfehler in der Konfigurationsdatei:%d: %s
fr: Erreur de syntaxe dans le fichier de configuration:%d: %s

source: ID of the parent window
de: ID des übergeordneten Fensters
fr: ID de la fenêtre parente

source: %s - Create translations from PO files
de: %s - Übersetzungen aus PO-Dateien erstellen
fr: %s - Créer des traductions à partir de fichiers PO

source: Usage: %s [<options>] [make|translate]
de: Aufruf: %s [<Optionen>] [make|translate]
fr: Utilisation: %s [<options>] [make|translate]

source: Commands are:
de: Befehle lauten:
fr: Les commandes sont:

source: make read all files listed in LINGUAS, and create C-source for translations
de: make Lies alle in LINGUAS aufgeführten Dateien und erstelle C-Quellcode für die Übersetzungen.
fr: make Faire lire tous les fichiers listés dans LINGUAS, et créer une source C pour les traductions

source: translate <lang> <files> translate C-sources
de: translate <lang> <files> Übersetze C-sourcen
fr: traduire <lang> <files> traduire les sources C

source: Options are:
de: Optionen sind:
fr: Les options sont:

source: -v, --verbose emit some progress messages
de: -v, --verbose gibt einige Fortschrittsmeldungen aus
fr: -v, --verbose afficher des messages de progression

source: -p, --podir <dir> lookup po-files in <dir>
de: -p, --podir <Verzeichnis> PO-Dateien in <Verzeichnis> suchen
fr: -p, --podir <dir> recherche les fichiers po dans <dir>

source: -o, --output <file> write output to <file>
de: -o, --output <Datei> Ausgabe in <Datei> schreiben
fr: -o, --output <fichier> écrire la sortie dans <fichier>

source: -d, --default-domain <name> specify packagename
de: -d, --default-domain <Name> Paketnamen angeben
fr: -d, --default-domain <nom> spécifiez le nom du paquet

source: -k, --keys <name> name of the key string table
de: -k, --keys <Name> Name der Schlüsselzeichenfolgentabelle
fr: -k, --keys <nom> nom de la table de chaînes de clés

source: --version print version and exit
de: --version Version und Copyright-Details anzeigen
fr: --version afficher la version et quitter

source: --help print this help and exit
de: --help Diese Hilfe anzeigen
fr: --help affiche cette aide et quitte

source: %s: unknown command %s
de: %s: Unbekannter Befehl %s
fr: %s: commande inconnue %s

source: Warning:
de: Warnung:
fr: Avertissement:

source: Error:
de: Fehler:
fr: Erreur:

source: %s: empty administrative entry
de: %s: Leerer Verwaltungseintrag
fr: %s: entrée administrative vide

source: %s: fields in administrative entry must end with \n
de: %s: Felder im Verwaltungseintrag müssen mit \n enden.
fr: %s: les champs de la saisie administrative doivent se terminer par \n

source: %s: Expecting "%s" in administrative entry
de: %s: Erwartet wird "%s" im Verwaltungseintrag
fr: %s: Attendu «%s» dans l’entrée administrative

source: %s: MIME version must be 1.0
de: %s: Die MIME-Version muss 1.0 sein
fr: %s: la version MIME doit être 1.0

source: %s: Content-Transfer-Encoding must be 8bit
de: %s: Content-Transfer-Encoding muss 8bit sein
fr: %s: L’encodage du transfert de contenu doit être de 8 bits

source: %s: missing charset
de: %s: Fehlender Zeichensatz
fr: %s: jeu de caractères manquant

source: %s: charset unsupported: %s
de: %s: Zeichensatz nicht unterstützt: %s
fr: %s: jeu de caractères non pris en charge: %s

source: %s: language '%s' does not match '%s' from LINGUAS
de: %s: Die Sprache '%s' stimmt nicht mit '%s' aus LINGUAS überein.
fr: %s: la langue «%s» ne correspond pas à «%s» de LINGUAS

source: %s: syntax error in Plural-Forms entry
de: %s: Syntaxfehler im Eintrag für Pluralformen
fr: %s: erreur de syntaxe dans l’entrée Plural-Forms

source: %s: unknown Plural-Forms entry
de: %s: unbekannter Eintrag für Pluralformen
fr: %s: entrée de formes plurielles inconnue

source: %s: missing Plural-Forms entry
de: %s: Fehlender Eintrag für Pluralformen
fr: %s: entrée Pluriel manquante

source: %s: bad administrative entry
de: %s: Fehlerhafter Verwaltungseintrag
fr: %s: entrée administrative incorrecte

source: too far backward
de: zu weit rückwärts
fr: trop en arrière

source: EOF reached inside comment
de: nicht beendeter Kommentar am Dateiende
fr: EOF a atteint un commentaire interne

source: %s:%d: EOF reached inside string
de: %s:%d: Dateiende innerhalb der Zeichenkette erreicht
fr: %s:%d: Fin de fichier atteinte à l'intérieur de la chaîne

source: %s:%d: EOS inside string
de: %s:%d: EOS innerhalb der Zeichenkette
fr: %s:%d: Fin de série dans la chaîne

source: %s:%d: internationalized messages should not contain the '\v' escape sequence
de: %s:%d: Internationalisierte Nachrichten sollten die Escape-Sequenz '\v' nicht enthalten.
fr: %s:%d: les messages internationalisés ne doivent pas contenir la séquence d'échappement «\v».

source: %s:%d: invalid control sequence '\%c'
de: %s:%d: Ungültige Steuersequenz '\%c'
fr: %s:%d: séquence de contrôle invalide '\%c'

source: msgid '%s' not found in %s (run 'xgettext' to generate it)
de: Die Meldung '%s' wurde in %s nicht gefunden. (Führen Sie 'xgettext' aus, um sie zu generieren.)
fr: msgid '%s' introuvable dans %s (exécutez 'xgettext' pour le générer)

source: could not open %s: %s
de: Die Datei '%s' konnte nicht geöffnet werden: %s
fr: Impossible d'ouvrir %s: %s

source: _("..." with no closing ) the string is %s
de: _("..." ohne schließende Klammer ) Die Zeichenkette ist %s
fr: _("..." sans fermeture ) la chaîne est %s

source: LINGUAS: bad lang specification "%s"
de: LINGUAS: unbekannte Sprachspezifikation "%s"
fr: LINGUAS: spécification de langue incorrecte «%s»

source: %s:%d: syntax error
de: %s:%d: Syntaxfehler
fr: %s:%d: erreur de syntaxe

source: %s:%d: stray ref ignored
de: %s:%d: Überflüssige Referenz ignoriert
fr: %s:%d: référence orpheline ignorée

source: %s:%d: unsupported entry %s
de: %s:%d: Nicht unterstützter Eintrag %s
fr: %s:%d: entrée %s non prise en charge

source: %s:%d: missing msgid
de: %s:%d: fehlende msgid
fr: %s:%d: identifiant de message manquant

source: %s:%d: wrong number of plural forms
de: %s:%d: Falsche Anzahl an Pluralformen
fr: %s:%d: nombre incorrect de formes plurielles

source: %s:%d: administrative entry must not have plural or context
de: %s:%d: Der administrative Eintrag darf keinen Plural oder Kontext enthalten.
fr: %s:%d: l'entrée administrative ne doit pas comporter de pluriel ni de contexte

source: %s:%d: duplicate entry %s
de: %s:%d: Doppelter Eintrag %s
fr: %s:%d: entrée en double %s

source: %s:%d: entries do not both end with '\n' in translation of '%s' to '%s'
de: %s:%d: Einträge enden bei der Übersetzung von '%s' nach '%s' nicht beide mit '\n'.
fr: %s:%d: les deux entrées ne se terminent pas par '\n' dans la traduction de '%s' en '%s'

source: %s:%d: entries do not both begin with '\n' in translation of '%s' to '%s'
de: %s:%d: Einträge beginnen nicht beide mit '\n' bei der Übersetzung von '%s' nach '%s'
fr: %s:%d: les deux entrées ne commencent pas par '\n' dans la traduction de '%s' en '%s'

source: %s:%d: syntax error (c = '%c')
de: %s:%d: Syntaxfehler (c = '%c')
fr: %s:%d: erreur de syntaxe (c = '%c')

source: LINGUAS: no languages found
de: LINGUAS: Keine Sprachen gefunden
fr: LINGUAS: aucune langue trouvée

source: unknown language %s
de: unbekannte Sprache %s
fr: langue inconnue %s

source: %s.po: untranslated: '%s'
de: %s.po: unübersetzt: '%s'
fr: %s.po: non traduit: '%s'

source: %s.po: translated %lu, untranslated %lu
de: %s.po: übersetzt %lu, nicht übersetzt %lu
fr: %s.po: %lu traduit, %lu non traduit

source: %s: length of keys %lu does not fit into nls_key_offset
de: %s: Die Länge der Schlüssel %lu passt nicht in nls_key_offset
fr: %s: la longueur des clés %lu ne tient pas dans nls_key_offset

source: %s.po: keys %lu (%lu bytes), translations %lu bytes
de: %s.po: Schlüssel %lu (%lu Bytes), Übersetzungen %lu Bytes
fr: %s.po: clés %lu (%lu octets), traductions %lu octets

source: %s: length of translations %lu does not fit into nls_key_offset
de: %s: Die Länge der Übersetzungen %lu passt nicht in nls_key_offset
fr: %s: la longueur des traductions %lu ne tient pas dans nls_key_offset

source: I only translate .c files
de: Ich übersetze nur .c-Dateien
fr: Je ne traduis que les fichiers .c

source: cannot create %s: %s
de: %s kann nicht erstellt werden: %s
fr: Impossible de créer %s: %s

source: monochrome
de: Monochrom

source: can't create %s: %s
de: Kann %s nicht erzeugen: %s

source: Catalan
de: Katalanisch
